In [18]:
# importing neccessary libraries
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\hp\anaconda3\lib\site-packages (9.3.0)

In [6]:
import mysql.connector as mc
from mysql.connector import Error
import pandas as pd

In [8]:
# creating a function for creating server
def create_server_connection(host_name ,user_name , user_password ):
    connection = None
    try:
        connection = mc.connect(
            host = host_name,
            user = user_name,
            password = user_password
        )
        print("Mysql database connected!")

    except Error as err:
        print(f"Error: '{err}' ")

    return connection   

pw = 'yuktisql'
database_name = 'workwith'
connection = create_server_connection("localhost","root",'yuktisql')

Mysql database connected!

In [10]:
#creating a databse

def create_database(connection , query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("database created")
    except Error as err:
        print(f"Error: '{err}' ")

create_database_query = "Create database workwith"
create_database(connection , create_database_query)

Error: '1007 (HY000): Can't create database 'workwith'; database exists'

In [12]:
# connecting to database
def create_db(host_name , user_name , password , db_name):
    connection = None
    try:
        connection = mc.connect(
            host = host_name,
            user = user_name,
            password = password,
            database = db_name
        )
        print("Database connnected great Job")

    except Error as err:
        print(err)

    return connection

In [14]:
# executing sql queries
def execute_query(connection , query):
    cursor = connection.cursor() #this establishes connection between mysql and python and to run the query
    try:
        cursor.execute(query)
        connection.commit()
        print("Query execution was done")
    except Error as err:
        print(err)

In [16]:
# creating table
create_orders_table = """ 
create table orders(
order_id int primary key,
cus_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_num varchar(20) 
);
"""

# call create_db function
connection = create_db("localhost","root",'yuktisql' , "workwith")
execute_query(connection, create_orders_table)

Database connnected great Job
1050 (42S01): Table 'orders' already exists

In [18]:
# inserting few records
data_orders = """ 
insert into orders values
(101 , 'yukti' , 'laptop', '2012-03-12', 2 , 800 , '7348705308'),
(102 , 'anupriya' , 'pendrive', '2012-03-12', 2 , 800 , '7348705308'),
(103 , 'kennon' , 'mobile ', '2012-03-12', 1, 800 , '7348705308'),
(104 , 'rahul' , 'biscuit', '2012-03-12', 30 , 800 , '7348705308'),
(105 , 'shivani' , 'ice-creame', '2012-03-12', 20 , 800 , '7348705308')

"""
connection = create_db("localhost","root",'yuktisql' , "workwith")
execute_query(connection, data_orders)

Database connnected great Job
1062 (23000): Duplicate entry '101' for key 'orders.PRIMARY'

In [24]:
# now printing the data
def read_query(connection,query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(err)

In [26]:
# using the select statement
q1 = """
select * from orders;
"""
connection = create_db("localhost","root",'yuktisql' , "workwith")
result = read_query(connection , q1)
for r in result:
    print(r)

Database connnected great Job
(101, 'yukti', 'laptop', datetime.date(2012, 3, 12), 2, 800.0, '7348705308')
(102, 'anupriya', 'pendrive', datetime.date(2012, 3, 12), 2, 800.0, '7348705308')
(103, 'kennon', 'mobile ', datetime.date(2012, 3, 12), 1, 800.0, '7348705308')
(104, 'rahul', 'biscuit', datetime.date(2012, 3, 12), 30, 800.0, '7348705308')
(105, 'shivani', 'ice-creame', datetime.date(2012, 3, 12), 20, 800.0, '7348705308')

In [32]:
q2 = """
select cus_name , phone_num  from orders;
"""
connection = create_db("localhost","root",'yuktisql' , "workwith")
result = read_query(connection , q2)
for r in result:
    print(r)

Database connnected great Job
('yukti', '7348705308')
('anupriya', '7348705308')
('kennon', '7348705308')
('rahul', '7348705308')
('shivani', '7348705308')

In [34]:
# get inly years
q3 = """
select year(date_ordered) from orders;
"""
connection = create_db("localhost","root",'yuktisql' , "workwith")
result = read_query(connection , q3)
for r in result:
    print(r)

Database connnected great Job
(2012,)
(2012,)
(2012,)
(2012,)
(2012,)

In [38]:
# using where clause
q4 = """
select * from orders
where quantity > 3;
"""
connection = create_db("localhost","root",'yuktisql' , "workwith")
result = read_query(connection , q4)
for r in result:
    print(r)

Database connnected great Job
(104, 'rahul', 'biscuit', datetime.date(2012, 3, 12), 30, 800.0, '7348705308')
(105, 'shivani', 'ice-creame', datetime.date(2012, 3, 12), 20, 800.0, '7348705308')

In [42]:
q5 = """
ALTER TABLE orders ADD COLUMN age int;
"""
connection = create_db("localhost","root",'yuktisql' , "workwith")
result = read_query(connection , q5)
for r in result:
    print(r)

Database connnected great Job

In [46]:
# checking whether table is added or not
q6 = """
desc orders
"""
connection = create_db("localhost","root",'yuktisql' , "workwith")
result = read_query(connection , q6)
for r in result:
    print(r)

Database connnected great Job
('order_id', 'int', 'NO', 'PRI', None, '')
('cus_name', 'varchar(30)', 'NO', '', None, '')
('product_name', 'varchar(20)', 'NO', '', None, '')
('date_ordered', 'date', 'YES', '', None, '')
('quantity', 'int', 'YES', '', None, '')
('unit_price', 'float', 'YES', '', None, '')
('phone_num', 'varchar(20)', 'YES', '', None, '')
('age', 'int', 'YES', '', None, '')

In [58]:
q7 = """
select * from orders order by quantity desc ;
"""
connection = create_db("localhost","root",'yuktisql' , "workwith")
result = read_query(connection , q7)
for r in result:
    print(r)

Database connnected great Job
(104, 'rahul', 'biscuit', datetime.date(2012, 3, 12), 30, 800.0, '7348705308', None)
(105, 'shivani', 'ice-creame', datetime.date(2012, 3, 12), 20, 800.0, '7348705308', None)
(101, 'yukti', 'laptop', datetime.date(2012, 3, 12), 2, 800.0, '7348705308', None)
(102, 'anupriya', 'pendrive', datetime.date(2012, 3, 12), 2, 800.0, '7348705308', None)
(103, 'kennon', 'mobile ', datetime.date(2012, 3, 12), 1, 800.0, '7348705308', None)

In [64]:
# create a dataframe from given table

from_db = []

for r in result:
    r = list(r)
    from_db.append(r)

columns = ["order_id","cus_name","product_name",
           "date_ordered","quantity","unit_price","phone_num" , "age"]

df = pd.DataFrame(from_db , columns = columns)
display(df)

,order_id,cus_name,product_name,date_ordered,quantity,unit_price,phone_num,age
0,104,rahul,biscuit,2012-03-12,30,800.0,7348705308,None
1,105,shivani,ice-creame,2012-03-12,20,800.0,7348705308,None
2,101,yukti,laptop,2012-03-12,2,800.0,7348705308,None
3,102,anupriya,pendrive,2012-03-12,2,800.0,7348705308,None
4,103,kennon,mobile,2012-03-12,1,800.0,7348705308,None

In [68]:
# using update commands
update = """
update orders set unit_price = 45
where order_id = 103
"""

connection = create_db("localhost","root",'yuktisql' , "workwith")
result = read_query(connection , update)
# for r in result:
#     print(r)
execute_query(connection,update)

Database connnected great Job
Query execution was done

In [72]:
q8 = """
select * from orders;
"""

connection = create_db("localhost","root",'yuktisql' , "workwith")
result = read_query(connection , q8)
for r in result:
    print(r)

Database connnected great Job
(101, 'yukti', 'laptop', datetime.date(2012, 3, 12), 2, 800.0, '7348705308', None)
(102, 'anupriya', 'pendrive', datetime.date(2012, 3, 12), 2, 800.0, '7348705308', None)
(103, 'kennon', 'mobile ', datetime.date(2012, 3, 12), 1, 45.0, '7348705308', None)
(104, 'rahul', 'biscuit', datetime.date(2012, 3, 12), 30, 800.0, '7348705308', None)
(105, 'shivani', 'ice-creame', datetime.date(2012, 3, 12), 20, 800.0, '7348705308', None)

In [78]:
# deleting a record
delete_order = """
delete from orders
where order_id = 103;
"""

connection = create_db("localhost","root",'yuktisql' , "workwith")
result = read_query(connection , delete_order)
execute_query(connection,update)

Database connnected great Job
Query execution was done

In [80]:
q9 = """
select * from orders;
"""

connection = create_db("localhost","root",'yuktisql' , "workwith")
result = read_query(connection , q9)
for r in result:
    print(r)

Database connnected great Job
(101, 'yukti', 'laptop', datetime.date(2012, 3, 12), 2, 800.0, '7348705308', None)
(102, 'anupriya', 'pendrive', datetime.date(2012, 3, 12), 2, 800.0, '7348705308', None)
(104, 'rahul', 'biscuit', datetime.date(2012, 3, 12), 30, 800.0, '7348705308', None)
(105, 'shivani', 'ice-creame', datetime.date(2012, 3, 12), 20, 800.0, '7348705308', None)